cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'

brew 'awscli'
brew 'composer'
brew 'direnv'
brew 'dlite'
brew 'docker
brew 'docker-compose'
brew 'docker-machine'
brew 'docker-swarm'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'git-flow'
brew 'go'
brew 'grc'
brew 'htop'
brew 'hugo'
brew 'imagemagick'
brew 'mysql'
brew 'nvm'
brew 'php70'
brew 'pyenv'
brew 'rancher-compose'
brew 'rbenv'
brew 'shellcheck'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'wp-cli'
brew 'youtube-dl'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# casks
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask '1password'
cask 'adobe-creative-cloud'
cask 'android-studio'
cask 'appcleaner'
cask 'atom'
cask 'beamer'
cask 'bestres'
cask 'calibre'
cask 'cyberduck'
cask 'dash'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'font-hack'
cask 'google-chrome'
cask 'google-photos-backup'
cask 'intellij-idea'
cask 'insync'
cask 'iterm2-beta'
cask 'kaleidoscope'
cask 'macpass'
cask 'messenger'
cask 'microsoft-office'
cask 'parallels-desktop'
cask 'phpstorm'
cask 'postico'
cask 'pycharm'
cask 'rubymine'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'slate'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'webstorm'

# https://github.com/sindresorhus/quick-look-plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
