Borke.Puppet
CraigMaslowski.erb
DotJoshJohnson.xml
EditorConfig.EditorConfig
HookyQR.JSDocTagComplete
HookyQR.beautify
HvyIndustries.crane
Kasik96.format-indent
PeterJausovec.vscode-docker
WakaTime.vscode-wakatime
Zignd.html-css-class-completion
akamud.vscode-caniuse
alefragnani.project-manager
codezombiech.gitignore
dbaeumer.jshint
dbaeumer.vscode-eslint
deerawan.vscode-dash
donjayamanne.githistory
donjayamanne.python
eg2.tslint
felixfbecker.php-debug
flowtype.flow-for-vscode
georgewfraser.vscode-javac
haaaad.ansible
hoovercj.ruby-linter
ikappas.phpcs
joelday.docthis
linyang95.phpmd
lukehoban.Go
minhthai.vscode-todo-parser
misogi.ruby-rubocop
mrmlnc.vscode-stylefmt
ms-vscode.cpptools
ms-vscode.csharp
ms-vscode.jscs
msjsdiag.debugger-for-chrome
rebornix.Ruby
robertohuertasm.vscode-icons
seanmcbreen.Spell
shanoor.vscode-nginx
shinnn.stylelint
vsmobile.vscode-react-native
waderyan.gitblame
zhutian.swig
